"""
Группа  Geektech 14Py - студент Акылбек Мамбетакунов
Месяц 4 - Django REST. Домашнее задание № 3

Домашнее задание 3.

Добавить создание режиссеров                       /api/v1/directors/
Добавить изменение и удаление режиссера   /api/v1/directors/<int:id>/

Добавить создание фильмов                            /api/v1/movies/
Добавить изменение и удаление фильм          /api/v1/movies/<int:id>/

Добавить создание отзывов                              /api/v1/reviews/
Добавить изменение и удаление отзыва          /api/v1/reviews/<int:id>/

"""