"""
Группа  Geektech 14Py - студент Акылбек Мамбетакунов
Месяц 3 - Django. Домашнее задание № 2

Домашняя Работа
Это домашнее задание продолжение прошлой домашки Задание :
1. Показать детально книгу , book detail
2. Добавлять логику в views.py , urls.py , book_detail.html
3. Все также как на уроке, только уже для другой модели объекта а именно
(Book)
4. Создать модели обьекта для отзывов книг BookFeedback (text,
created_date, foreign_key(Book))
5. Отобразить отзывы о книге в book_detail.html
"""