"""
Группа  Geektech 14Py - студент Акылбек Мамбетакунов
Месяц 3 - Django. Домашнее задание № 1

Домашняя Работа
Создайте новый Джанго проект для домашних заданий
То что создали в классе будет только для классной работы Задание :
1. Сначала создайте новое приложение book (комманда - python manage.py startapp book)
2. Добавьте его в Installed_apps
3. Создать в models.py новую модельку Book ( title, description, image, created_date,
updated_date, author ) не забыть прописать миграции
4. Подготовить для него шаблон html, views.py , urls.py , admin.py как мы и делали на
уроке
"""

#