"""
Группа  Geektech 14Py - студент Акылбек Мамбетакунов
Месяц 2 - ООП. Домашнее задание №3

Задача #1 Множественное Наследование (Ромбовидный)
1. Создать 4 класса и с помощью их преобразовать РОМБОВИДНЫЙ тип множественного наследования
2. У суперкласса должно быть не меньше 4 атрибутов
3. У каждого класса должно быть не меньше 2 атрибутов
4. Также должны быть соблюдены def __str__(self) + super()
5. К каждому классу создать о


Задача #2 Инкапсуляция (+ 1 класс объекта )
1. Создать один класс в котором вы пропишете по одному методу (внутреннего и защищенного)
2. В этом классе должно быть также по одному атрибуту (внутреннего и защищенного)

Задача #3 Полиморфизм без наследования(+ 3 класса объекта )
1. Создать три разных класса в котором будут одинаковые методы по названию например (attack)
2. Но логика этого самого метода будут разные как в случае примера с мечником , лучником и волшебником

Задача #4 Полиморфизм с наследованием (+ 3 класса объекта )
1. Все тоже самое как в случае с Полиморфизмом без наследование , единственное различие здесь присутствует
наследование трехступенчатой концепций (дед-отец-ребенок)
"""